EZ32Inc/esp32jtag_firmware/main/network/uart_websocket.c
#include <string.h>
#include <stdlib.h>
#include <fcntl.h>
#include <ctype.h>
#include <inttypes.h>
#include "esp_http_server.h"
#include "esp_chip_info.h"
#include "esp_random.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "esp_vfs.h"
#include "driver/gpio.h"
#include "driver/uart.h"

#include "cJSON.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/queue.h"
#include "freertos/stream_buffer.h"

#include "uart_websocket.h"
#include "web_server.h"
#define WEB_MOUNT_POINT "/www"

static const char *TAG = "uart_websocket";

#include "storage.h"
#include "esp32jtag_common.h"
#include "port_cfg.h"
#include "types.h"

#define ECHO_TEST					(0)	// echo back test for websocket
#define USE_STREAM_CALLBACK			(0)	// untested: try only when necessary
#define REST_CHECK(a, str, goto_tag, ...) \
    do { \
		if (!(a)) { \
			ESP_LOGE(TAG, "%s(%d): " str, __FUNCTION__, __LINE__, ##__VA_ARGS__); \
		goto goto_tag; \
		} \
	} while (0)
#define CHECK_FILE_EXTENSION(filename, ext) \
	(strcasecmp(&filename[strlen(filename) - strlen(ext)], ext) == 0)

static esp_err_t init_hardware(void);
static void ws_async_send(void *arg);
static void uart_read_task(void *pvParameters);
static esp_err_t websocket_handler(httpd_req_t *req);

#if USE_STREAM_CALLBACK
void vStreamSendCallback(StreamBufferHandle_t xStreamBuffer,
		BaseType_t xIsInsideISR, BaseType_t * const pxPriority);
#endif

volatile bool config_received = false;
static vprintf_like_t original_vprintf = NULL;
volatile bool g_log_monitor_enabled = false;

/* rest server context data structure */
typedef struct rest_server_context {
    char base_path[ESP_VFS_PATH_MAX + 1];
    char scratch[SCRATCH_BUFSIZE];
} rest_server_context_t;

/* response data structure */
typedef struct _resp_data {
    httpd_handle_t hd;
    int fd;
	uint8_t data[UART_BUF_SIZE];
} resp_data_t;

resp_data_t resp_arg;				// response data
uint8_t uart_data[UART_BUF_SIZE];	// uart data
StreamBufferHandle_t xDataBuffer;	// stream buffer from UART to WS
QueueHandle_t s_uart_queue;

typedef struct {
    bool tasks_expected;
    bool tasks_started;
    uint32_t total_rx_messages;
    uint32_t total_rx_bytes;
    uint32_t last_rx_len;
    int64_t last_rx_us;
    uint8_t last_rx_data[64];
} uart_debug_state_t;

static uart_debug_state_t s_uart_debug = {0};

static void uart_debug_record_rx(const uint8_t *data, size_t len)
{
    size_t copy_len = len;

    if (!data || len == 0) {
        return;
    }

    s_uart_debug.total_rx_messages++;
    s_uart_debug.total_rx_bytes += (uint32_t)len;
    s_uart_debug.last_rx_len = (uint32_t)len;
    s_uart_debug.last_rx_us = esp_timer_get_time();

    if (copy_len > sizeof(s_uart_debug.last_rx_data)) {
        copy_len = sizeof(s_uart_debug.last_rx_data);
    }
    memset(s_uart_debug.last_rx_data, 0, sizeof(s_uart_debug.last_rx_data));
    memcpy(s_uart_debug.last_rx_data, data, copy_len);
}

static void uart_debug_format_preview(const uint8_t *data, size_t len, char *ascii, size_t ascii_size, char *hex, size_t hex_size)
{
    size_t preview_len = len > 16 ? 16 : len;
    size_t ascii_pos = 0;
    size_t hex_pos = 0;

    if (ascii_size > 0) {
        ascii[0] = '\0';
    }
    if (hex_size > 0) {
        hex[0] = '\0';
    }

    for (size_t i = 0; i < preview_len; ++i) {
        if (ascii_pos + 1 < ascii_size) {
            ascii[ascii_pos++] = isprint(data[i]) ? (char)data[i] : '.';
            ascii[ascii_pos] = '\0';
        }
        if (hex_pos + 3 < hex_size) {
            int written = snprintf(hex + hex_pos, hex_size - hex_pos, "%02X%s", data[i], (i + 1U < preview_len) ? " " : "");
            if (written < 0) {
                break;
            }
            hex_pos += (size_t)written;
        }
    }
}

void uart_websocket_get_debug_json(char *out, size_t out_size)
{
    char ascii[sizeof(s_uart_debug.last_rx_data) + 1];
    char hex[(sizeof(s_uart_debug.last_rx_data) * 3) + 1];
    size_t preview_len;
    int64_t age_ms = -1;

    if (!out || out_size == 0) {
        return;
    }

    preview_len = s_uart_debug.last_rx_len;
    if (preview_len > sizeof(s_uart_debug.last_rx_data)) {
        preview_len = sizeof(s_uart_debug.last_rx_data);
    }
    uart_debug_format_preview(
        s_uart_debug.last_rx_data,
        preview_len,
        ascii,
        sizeof(ascii),
        hex,
        sizeof(hex)
    );

    if (s_uart_debug.last_rx_us > 0) {
        age_ms = (esp_timer_get_time() - s_uart_debug.last_rx_us) / 1000;
    }

    snprintf(
        out,
        out_size,
        "{\"status\":\"ok\",\"uart_port_num\":%d,\"gpio_txd\":%d,\"gpio_rxd\":%d,"
        "\"uart_port_sel\":%u,\"portb_cfg\":%u,\"tasks_expected\":%s,\"tasks_started\":%s,"
        "\"total_rx_messages\":%" PRIu32 ",\"total_rx_bytes\":%" PRIu32 ","
        "\"last_rx_len\":%" PRIu32 ",\"last_rx_age_ms\":%" PRId64 ","
        "\"last_rx_ascii\":\"%s\",\"last_rx_hex\":\"%s\"}",
        (int)UART_PORT_NUM,
        (int)GPIO_UART_TXD,
        (int)GPIO_UART_RXD,
        (unsigned)g_app_params.uart_port_sel,
        (unsigned)gbl_pb_cfg,
        s_uart_debug.tasks_expected ? "true" : "false",
        s_uart_debug.tasks_started ? "true" : "false",
        s_uart_debug.total_rx_messages,
        s_uart_debug.total_rx_bytes,
        s_uart_debug.last_rx_len,
        age_ms,
        ascii,
        hex
    );
}

static int custom_log_vprintf(const char *format, va_list args) {
    if (g_log_monitor_enabled) {
        /* Recursion guard: prevent WS-send errors from re-triggering this handler */
        static int in_log = 0;
        if (!in_log) {
            in_log = 1;
            char temp_log_buffer[256];
            int written = vsnprintf(temp_log_buffer, sizeof(temp_log_buffer), format, args);
            if (written > 0) {
                if (xDataBuffer) xStreamBufferSend(xDataBuffer, temp_log_buffer, written, 0);
                if (resp_arg.fd > 0 && resp_arg.hd != NULL) {
                    httpd_queue_work(resp_arg.hd, ws_async_send, (void *)&resp_arg);
                }
            }
            in_log = 0;
        }
    }

