EZ32Inc/esp32jtag_firmware/main/network/uart_websocket.c
    // Always call original to keep serial output
    if (original_vprintf) {
        return original_vprintf(format, args);
    }
    return vprintf(format, args);
}

static void set_uart_params(uart_config_t *uart_config) {
    char *val = NULL;

    // Baud Rate
    if (storage_alloc_and_read(UART_BAUD_KEY, &val) == ESP_OK && val) {
        uart_config->baud_rate = atoi(val);
        free(val); val = NULL;
    } else {
        uart_config->baud_rate = 115200;
    }

    // Data Bits
    if (storage_alloc_and_read(UART_DATA_BITS_KEY, &val) == ESP_OK && val) {
        int dbits = atoi(val);
        if (dbits == 5) uart_config->data_bits = UART_DATA_5_BITS;
        else if (dbits == 6) uart_config->data_bits = UART_DATA_6_BITS;
        else if (dbits == 7) uart_config->data_bits = UART_DATA_7_BITS;
        else uart_config->data_bits = UART_DATA_8_BITS;
        free(val); val = NULL;
    } else {
        uart_config->data_bits = UART_DATA_8_BITS;
    }

    // Stop Bits
    if (storage_alloc_and_read(UART_STOP_BITS_KEY, &val) == ESP_OK && val) {
        if (strcmp(val, "1.5") == 0) uart_config->stop_bits = UART_STOP_BITS_1_5;
        else if (strcmp(val, "2") == 0) uart_config->stop_bits = UART_STOP_BITS_2;
        else uart_config->stop_bits = UART_STOP_BITS_1;
        free(val); val = NULL;
    } else {
        uart_config->stop_bits = UART_STOP_BITS_1;
    }

    // Parity
    if (storage_alloc_and_read(UART_PARITY_KEY, &val) == ESP_OK && val) {
        if (strcmp(val, "e") == 0) uart_config->parity = UART_PARITY_EVEN;
        else if (strcmp(val, "o") == 0) uart_config->parity = UART_PARITY_ODD;
        else uart_config->parity = UART_PARITY_DISABLE;
        free(val); val = NULL;
    } else {
        uart_config->parity = UART_PARITY_DISABLE;
    }
}

/*
 * initialize UART port and power state monitor port
 */
static esp_err_t init_hardware() {
	// UART
	uart_config_t uart_config = {
		.baud_rate = 115200,
		.data_bits = UART_DATA_8_BITS,
		.parity = UART_PARITY_DISABLE,
		.stop_bits = UART_STOP_BITS_1,
		.flow_ctrl = UART_HW_FLOWCTRL_DISABLE,
		.source_clk = UART_SCLK_DEFAULT,
	};
    
    set_uart_params(&uart_config);

	ESP_ERROR_CHECK(uart_param_config(UART_PORT_NUM, &uart_config));
	ESP_ERROR_CHECK(uart_set_pin(UART_PORT_NUM, GPIO_UART_TXD, GPIO_UART_RXD,
				UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE));
	ESP_ERROR_CHECK(uart_driver_install(UART_PORT_NUM, UART_BUF_SIZE,
				UART_BUF_SIZE, 0, NULL, 0));
    ESP_LOGI(TAG, "init UART %d OK: Baud:%d, DB:%d, SB:%d, Parity:%d", 
             UART_PORT_NUM, uart_config.baud_rate, uart_config.data_bits, uart_config.stop_bits, uart_config.parity);
	return ESP_OK;
}

#if 0
/*
 * power control task
 */
static void target_pwr_ctrl_task(void *pvParameters) {
	int gpio_pin;
	gpio_config_t io_config = {};

	if((int)pvParameters == 1) {
		// wake up
		gpio_pin = GPIO_PWR_WAKE;
		ESP_LOGI(TAG, "waking up target");
	} else {
		// shutdown
		gpio_pin = GPIO_PWR_SHDN;
		ESP_LOGI(TAG, "shutting down target");
	}

	// set up the control pin
	io_config.intr_type = GPIO_INTR_DISABLE;
	io_config.mode = GPIO_MODE_OUTPUT;
	io_config.pin_bit_mask = (1ULL << gpio_pin);
	io_config.pull_down_en = 0;
	io_config.pull_up_en = 1;	// prevent glitch ?
	gpio_config(&io_config);

	// 500 msec active low pulse
	gpio_set_level(gpio_pin, 0);
	vTaskDelay( 500 / portTICK_PERIOD_MS);
	gpio_set_level(gpio_pin, 1);

	// reset the pin
	gpio_reset_pin(gpio_pin);

	// kill itself
	vTaskDelete(NULL);
}
#endif

/*
 * async send function, which we put into the httpd work queue
 */
static void ws_async_send(void *arg)
{
    resp_data_t *r = arg;
    httpd_ws_frame_t ws_pkt;
    memset(&ws_pkt, 0, sizeof(httpd_ws_frame_t));
    ws_pkt.type = HTTPD_WS_TYPE_TEXT;

	httpd_handle_t hd = r->hd;
	int fd = r->fd;

    // Check if the server handle is valid
    if (hd == NULL) {
        ESP_LOGE(TAG, "hd is NULL");
        return;
    }

    // Check if the file descriptor is valid (it might have been cleared by close event)
    if (fd <= 0) {
        // This is normal if connection closed while work was in queue. Be silent or debug log.
        // ESP_LOGD(TAG, "fd is invalid/closed: %d, skipping async send", fd);
        return;
    }

    int len = xStreamBufferReceive(xDataBuffer, r->data, sizeof(r->data),
            (TickType_t) 10);
            
    // Only send if we actually received data
    if (len > 0) {
        ws_pkt.len = len;
        ws_pkt.payload = r->data;
        //ESP_LOGI(TAG, "From Buffer: len=%d, payload: %.*s", len, len, ws_pkt.payload);
        esp_err_t send_ret = httpd_ws_send_frame_async(hd, fd, &ws_pkt);
        if (send_ret != ESP_OK) {
            ESP_LOGE(TAG, "httpd_ws_send_frame_async failed with error: %s (fd=%d)", esp_err_to_name(send_ret), fd);
            
            // If the socket is invalid, stop the log monitor to prevent error spam
            if (send_ret == ESP_ERR_INVALID_ARG || send_ret == ESP_ERR_HTTPD_INVALID_REQ) {
                 ESP_LOGW(TAG, "Invalid socket detected in async send. Disabling Log Monitor and clearing session.");
                 g_log_monitor_enabled = false;
                 // We can also clear resp_arg to be safe
                 if (resp_arg.fd == fd) {
                     memset(&resp_arg, 0, sizeof(resp_data_t));
                 }
            }
        }
    }
}

#if 0 //AAron's code to log debug info to webterm
static void ws_async_send(void *arg)
{
    resp_data_t *r = (resp_data_t *)arg;

    httpd_ws_frame_t ws_pkt;
    memset(&ws_pkt, 0, sizeof(httpd_ws_frame_t));
    ws_pkt.type = HTTPD_WS_TYPE_TEXT;

    ws_pkt.len = strlen((const char *)r->data);
    ws_pkt.payload = r->data;

    ESP_LOGI(TAG, "From Buffer: %.*s", ws_pkt.len, ws_pkt.payload);
    httpd_ws_send_frame_async(r->hd, r->fd, &ws_pkt);
    
    free(r);
}

static void uart_read_task(void *pvParameters) {
    resp_data_t client_info;
    
    if (xQueueReceive(s_ws_client_queue, &client_info, portMAX_DELAY) != pdPASS) {
        ESP_LOGE(TAG, "Failed to get first client from queue");
        vTaskDelete(NULL);
    }
    
    while(1) {
        // Read data from the StreamBuffer
        size_t len = xStreamBufferReceive(xDataBuffer, uart_data, (UART_BUF_SIZE - 1), 20 / portTICK_PERIOD_MS);
        
        if (len > 0) {
            resp_data_t *resp = (resp_data_t *)malloc(sizeof(resp_data_t));
            if (resp == NULL) {
                ESP_LOGE(TAG, "Failed to allocate memory for async response");
                continue;
            }
            
            resp->hd = client_info.hd;
            resp->fd = client_info.fd;
            memcpy(resp->data, uart_data, len);
            resp->data[len] = '\0';
            
            esp_err_t ret = httpd_queue_work(resp->hd, ws_async_send, (void *)resp);
            if(ret != ESP_OK) {
                ESP_LOGE(TAG, "httpd_queue_work failed with error %s, waiting for new client.", esp_err_to_name(ret));
                free(resp);
                if (xQueueReceive(s_ws_client_queue, &client_info, portMAX_DELAY) != pdPASS) {
                    ESP_LOGE(TAG, "Failed to get next client from queue");
                    vTaskDelete(NULL);
                }
            }
        }
    }
}
#else
/*
 * UART incoming data handling task.
 * Note: could be unified with the general UART event handler in the future.
 */
static void uart_read_task(void *pvParameters) {
    ESP_LOGI(TAG, "In uart_read_task()");
    s_uart_debug.tasks_started = true;

