EZ32Inc/esp32jtag_firmware/main/network/uart_websocket.c
    httpd_ws_frame_t ws_pkt;
	memset(&ws_pkt, 0, sizeof(httpd_ws_frame_t));
	ws_pkt.type = HTTPD_WS_TYPE_TEXT;

	while(1) {
		// wait for UART RX input
		int len = uart_read_bytes(UART_PORT_NUM, uart_data, (UART_BUF_SIZE -1),
				20 / portTICK_PERIOD_MS);
		// need to terminate the string
		uart_data[len] = 0x00;

		if(len) {
            char ascii[32];
            char hex[64];
            uart_debug_record_rx(uart_data, (size_t)len);
            uart_debug_format_preview(uart_data, (size_t)len, ascii, sizeof(ascii), hex, sizeof(hex));
			ESP_LOGI(TAG, "UART RX len=%d ascii='%s' hex=%s", len, ascii, hex);
			// push data into stream
            xStreamBufferSend(xDataBuffer, uart_data, len, (TickType_t) 10);
            if (resp_arg.fd > 0) {
                esp_err_t ret = httpd_queue_work(resp_arg.hd, ws_async_send, (void *)&resp_arg);
                if(ret != ESP_OK) {
                    ESP_LOGE(TAG, "httpd_queue_work failed");
                }
            }
		}
	}
}

#endif
void uart_write_task(void *pvParameters) {
    char *message;
    for(;;) {
        if (xQueueReceive(s_uart_queue, &message, portMAX_DELAY) == pdPASS) {
            /* LOG_ON / LOG_OFF are now handled directly in websocket_handler
             * before they reach this queue.  Any message arriving here is
             * plain UART data to be forwarded to the target. */
            ESP_LOGI(TAG, "Input to send: %s", message);
            
            // Write to UART
            int len = strlen(message);
            if(len>0){
                int txBytes = uart_write_bytes(UART_PORT_NUM, message, len);
                if (txBytes > 0) {
                    ESP_LOGI(TAG, "Sent %d bytes to UART", txBytes);
                } else {
                    ESP_LOGE(TAG, "Failed to send to UART");
                }

                if (strcmp(message, "stop\n") == 0) {
                    config_received = true;
                    ESP_LOGI(TAG, "Configuration loop will now stop.");
                }
            }
            free(message);
        }
    }
}

#if 0
static esp_err_t set_content_type_from_file(httpd_req_t *req, const char *filepath)
{
    const char *type = "text/plain";
    if (CHECK_FILE_EXTENSION(filepath, ".html")) {
        type = "text/html";
    } else if (CHECK_FILE_EXTENSION(filepath, ".js")) {
        type = "text/javascript";
    } else if (CHECK_FILE_EXTENSION(filepath, ".css")) {
        type = "text/css";
    } else if (CHECK_FILE_EXTENSION(filepath, ".png")) {
        type = "image/png";
    } else if (CHECK_FILE_EXTENSION(filepath, ".ico")) {
        type = "image/x-icon";
    } else if (CHECK_FILE_EXTENSION(filepath, ".svg")) {
        type = "image/svg+xml";
    }
    return httpd_resp_set_type(req, type);
}

esp_err_t power_post_handler(httpd_req_t *req)
{
    int total_len = req->content_len;
    int cur_len = 0;
    char *buf = ((rest_server_context_t *)(req->user_ctx))->scratch;
    int received = 0;
    if (total_len >= SCRATCH_BUFSIZE) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "content too long");
        return ESP_FAIL;
    }
    while (cur_len < total_len) {
        received = httpd_req_recv(req, buf + cur_len, total_len);
        if (received <= 0) {
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Failed to post control value");
            return ESP_FAIL;
        }
        cur_len += received;
    }
    buf[total_len] = '\0';

    cJSON *root = cJSON_Parse(buf);
    char *state = cJSON_GetObjectItem(root, "power")->valuestring;

    if( strncmp((const char*)state, "on", sizeof(state)) == 0 ||
            strncmp((const char*)state, "ON", sizeof(state)) == 0 ||
            strncmp((const char*)state, "On", sizeof(state)) == 0) {
        httpd_resp_sendstr(req, "Waking up target device");
        xTaskCreate(target_pwr_ctrl_task, "target_pwr_ctrl_task", 2048, (void*)1, 10, NULL);
    } else if( strncmp((const char*)state, "off", sizeof(state)) == 0 ||
            strncmp((const char*)state, "Off", sizeof(state)) == 0 ||
            strncmp((const char*)state, "Off", sizeof(state)) == 0) {
        httpd_resp_sendstr(req, "Shutting down target device");
        xTaskCreate(target_pwr_ctrl_task, "target_pwr_ctrl_task", 2048, (void*)0, 10, NULL);
    } else {
        httpd_resp_sendstr(req, "Invalid power state detected");
    }

    ESP_LOGI(TAG, "Power control: %s", state);

    cJSON_Delete(root);
    return ESP_OK;
}

esp_err_t power_get_handler(httpd_req_t *req)
{
    httpd_resp_set_type(req, "application/json");
    cJSON *root = cJSON_CreateObject();

    gpio_set_pull_mode(GPIO_UART_RXD, GPIO_PULLDOWN_ONLY);
    int state = gpio_get_level(GPIO_UART_RXD);
    gpio_set_pull_mode(GPIO_UART_RXD, GPIO_PULLUP_ONLY);

    if(state == 1) {
        cJSON_AddStringToObject(root, "power", "on");
    } else {
        cJSON_AddStringToObject(root, "power", "off");
    }
    const char *power_state = cJSON_Print(root);
    ESP_LOGI(TAG, "Power state: %s", power_state);

    httpd_resp_sendstr(req, power_state);
    free((void *)power_state);
    cJSON_Delete(root);

    return ESP_OK;
}
#endif

esp_err_t websocket_handler(httpd_req_t *req)
{
    if (req->method == HTTP_GET) {
        ESP_LOGI(TAG, "Handshake done, new connection opened");
        // New client connects
        resp_arg.hd = req->handle;
        int new_fd = httpd_req_to_sockfd(req);
        if (new_fd > 0) {
            resp_arg.fd = new_fd;
            ESP_LOGI(TAG, "New WS connection: fd=%d", new_fd);
            
            // Clear any old data from the stream buffer to prevent blasting old logs
            xStreamBufferReset(xDataBuffer);
        } else {
            ESP_LOGE(TAG, "Failed to get sockfd for new connection");
            return ESP_FAIL;
        }

        // Reset log monitor state on new connection to avoid mismatch
        g_log_monitor_enabled = false; 
        return ESP_OK;

    } else {
        //ESP_LOGI(TAG, "Frame/Other req: method=%d", req->method);
    }

    // Removed blocking return to allow frame processing code below to run
    //return ESP_OK;

