EZ32Inc/esp32jtag_firmware/main/network/uart_websocket.c
    httpd_ws_frame_t ws_pkt;
    memset(&ws_pkt, 0, sizeof(httpd_ws_frame_t));
    
    // Get frame header
    esp_err_t ret = httpd_ws_recv_frame(req, &ws_pkt, 0);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "httpd_ws_recv_frame failed to get frame info with %d", ret);
        return ret;
    }

    //ESP_LOGI(TAG, "WS Frame: type=%d, len=%d", ws_pkt.type, ws_pkt.len);

    if (ws_pkt.type == HTTPD_WS_TYPE_CLOSE) {
        int close_fd = httpd_req_to_sockfd(req);
        ESP_LOGI(TAG, "Connection closed (fd=%d)", close_fd);
        
        // Only clear global state if the closing connection is the active one
        if (resp_arg.fd == close_fd) {
             g_log_monitor_enabled = false;
             memset(&resp_arg, 0, sizeof(resp_data_t));
             ESP_LOGI(TAG, "Cleared active session state");
        } else {
             ESP_LOGW(TAG, "Closed connection (fd=%d) does not match active session (fd=%d), ignoring cleanup", close_fd, resp_arg.fd);
        }
        return ESP_OK;
    }

    if (ws_pkt.len) {
        char *message_buffer = (char *)malloc(ws_pkt.len + 1);
        if (message_buffer == NULL) {
            ESP_LOGE(TAG, "Failed to allocate memory for payload");
            return ESP_ERR_NO_MEM;
        }

        ws_pkt.payload = (uint8_t *)message_buffer;
        ret = httpd_ws_recv_frame(req, &ws_pkt, ws_pkt.len);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "httpd_ws_recv_frame failed to receive payload with %d", ret);
            free(message_buffer);
            return ret;
        }
        
        message_buffer[ws_pkt.len] = '\0';
        //ESP_LOGI(TAG, "WS Recv Payload: %s", message_buffer);

        /* Handle control commands immediately — independent of whether
         * uart_write_task is running (it only starts when Port B is in
         * UART mode, but the Log Monitor must work in any Port B mode). */
        if (strcmp(message_buffer, "LOG_ON") == 0) {
            g_log_monitor_enabled = true;
            xStreamBufferReset(xDataBuffer);   /* discard stale buffered data */
            ESP_LOGI(TAG, "Log Monitor ENABLED");
            free(message_buffer);
            return ESP_OK;
        }
        if (strcmp(message_buffer, "LOG_OFF") == 0) {
            g_log_monitor_enabled = false;
            ESP_LOGI(TAG, "Log Monitor DISABLED");
            free(message_buffer);
            return ESP_OK;
        }

        /* All other messages are UART data — forward to uart_write_task */
        if (s_uart_queue == NULL || xQueueSend(s_uart_queue, &message_buffer, 0) != pdTRUE) {
            ESP_LOGE(TAG, "Failed to send message to UART write queue");
            free(message_buffer);
        } else {
             //ESP_LOGI(TAG, "Enqueued message for UART TX");
        }
    }
    return ESP_OK;
}

esp_err_t uart_websocket_add_handlers(httpd_handle_t server) {

    // If USB UART is selected, return and do not initialize Web UART
    if (g_app_params.uart_port_sel == 0) {
        ESP_LOGI(TAG, "UART Web Terminal disabled (USB mode selected).");
        return ESP_OK;
    }
    // Else (1), continue to initialize Web UART

	ESP_ERROR_CHECK(init_hardware());
    ESP_LOGI(TAG, "init UART %d done", UART_PORT_NUM);

    REST_CHECK(server, "Invalid server handle", err);

    s_uart_queue = xQueueCreate(10, sizeof(char*));
    REST_CHECK(s_uart_queue != NULL, "UART queue creation failed", err);

    original_vprintf = esp_log_set_vprintf(custom_log_vprintf);

    // Allocate StreamBuffer in PSRAM
    xDataBuffer = xStreamBufferCreateWithCaps(UART_BUF_SIZE * 2, 1, MALLOC_CAP_SPIRAM);
    REST_CHECK(xDataBuffer != NULL, "Stream buffer creation failed", err);

    // Allocate REST context in PSRAM
    rest_server_context_t *rest_context = heap_caps_calloc(
        1, sizeof(rest_server_context_t), MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    // If we failed to make the context, that's a real error
    REST_CHECK(rest_context, "No memory for rest context", err);

    strlcpy(rest_context->base_path, WEB_MOUNT_POINT, sizeof(rest_context->base_path));
#if 0
    ESP_LOGI(TAG, "aliDbg sizeof(rest_server_context_t)=%d, sizeof(base_path)=%d sizeof(resp_data_t)=%d",
             sizeof(rest_server_context_t),
             sizeof(rest_context->base_path),
             sizeof(resp_data_t));
#endif

#if 0
    s_ws_client_queue = xQueueCreate(5, sizeof(resp_data_t));
    REST_CHECK(s_ws_client_queue != NULL, "WS client queue creation failed", err);

    httpd_uri_t power_post_uri = {
        .uri = "/api/v1/pwrctrl",
        .method = HTTP_POST,
        .handler = power_post_handler,
        .user_ctx = rest_context
    };
    httpd_register_uri_handler(server, &power_post_uri);

    httpd_uri_t power_get_uri = {
        .uri = "/api/v1/pwrstate",
        .method = HTTP_GET,
        .handler = power_get_handler,
        .user_ctx = rest_context
    };
    httpd_register_uri_handler(server, &power_get_uri);
#endif

	// URI hander for websocket
    httpd_uri_t websocket_uri = {
        .uri = "/ws",
        .method = HTTP_GET,
        .handler = websocket_handler,
        .user_ctx = rest_context,
		.is_websocket = true
    };
    httpd_register_uri_handler(server, &websocket_uri);

    s_uart_debug.tasks_expected = (!AEL_BOARD_IS_ESP32JTAG || gbl_pb_cfg == PB_UART_SRESET_VTARGET);
    if (s_uart_debug.tasks_expected) {
        ESP_LOGI(TAG, "Starting UART tasks...");
        xTaskCreate(uart_read_task, "uart_read_task", 8192, NULL, 10, NULL);
        xTaskCreate(uart_write_task, "uart_write_task", 4096, NULL, 10, NULL);
    } else {
        ESP_LOGW(TAG, "UART tasks not started: board=%d port_b_cfg=%u uart_port_sel=%u",
                 AEL_BOARD_IS_ESP32JTAG ? 1 : 0,
                 (unsigned)gbl_pb_cfg,
                 (unsigned)g_app_params.uart_port_sel);
    }

    return ESP_OK;

err:
    if (s_uart_queue) vQueueDelete(s_uart_queue);
    if (xDataBuffer) vStreamBufferDelete(xDataBuffer);
    return ESP_FAIL;
}
